// -------------------------- 1 пункт --------------------------
// -------------------------------------------------------------
// -------------------------------------------------------------

// Условие------------------------------------------------------
// 1. Напиши функцию greet, 
// которая принимает имя (тип string) и возвращает строку "Hello, <name>!".
// 
// 2. Типизируй эту функцию
// -------------------------------------------------------------

function greet(name: string): string {
    // ... логика

    return `Hello, ${name}`
}

// Пример
greet("Alice"); // "Hello, Alice!"


// -------------------------- 2 пункт --------------------------
// -------------------------------------------------------------
// -------------------------------------------------------------

// Условие------------------------------------------------------
// 1.Создай переменную
//
// 2. Типизируй ее так, чтобы она принимала как цифры, так и массив строк
//
// 3. Присвой короткое значение этой переменной
// -------------------------------------------------------------

const variable: number | string[] = ["12,", "32"]

