// -------------------------- 1 пункт --------------------------
// -------------------------------------------------------------
// -------------------------------------------------------------

// Условие------------------------------------------------------
// 1. Типизируй аргументы фильтрации базара
//
// 2. Типизируй возвращаемое значение функции
// -------------------------------------------------------------

// const variable = 
// type FilterChecker = // ...

function filterBazar(bazar, filterCondition: FilterChecker) {
    return bazar.filter(filterCondition)
}

// -------------------------- 2 пункт --------------------------
// -------------------------------------------------------------
// -------------------------------------------------------------

// Условие------------------------------------------------------
// 1. Создай тип функции колбека
//
// 2. Подключи этот тип к кастомной реализации forEach
// -------------------------------------------------------------

// type Callback =

function customForEach(arr: unknown[], callback) {
    arr.forEach(callback)
}