// -------------------------- 1 пункт --------------------------
// -------------------------------------------------------------
// -------------------------------------------------------------

// Условие------------------------------------------------------
// 1. Создать цепочку наследования Human -> Worker -> Programmer
//
// 2. Каждый тип должен РАСШИРЯТЬ родительский тип 1-2 полями
// -------------------------------------------------------------

// const variable = 
type Human = {
    name: string
}

// type Worker = 

// type Programmer = 

// -------------------------- 2 пункт --------------------------
// -------------------------------------------------------------
// -------------------------------------------------------------

// Условие------------------------------------------------------
// У вас есть завод, который работает в зависимости от того какое действие в него передали
// Например - create-steel / repair-building / create-cars / repair-cars и тд ....
//
// 1. Создать 5 типов различных действий (они должны обязательно иметь поле-литерал type: "<название действия>")
//
// 2. Сделать так, чтобы action мог принять любое из 5 значений созданных экшенов
// -------------------------------------------------------------

type CreateSteelAction = {
    type: "create-steel"
}

// и тд.....

// type Action = 

function fabric(action) {
    switch (action.type) {
        case "create-steel": 
            // Some logic for specific action ...
        // И тд для каждого экшена
    }
}