// -------------------------- 1 пункт --------------------------
// -------------------------------------------------------------
// -------------------------------------------------------------

// Условие------------------------------------------------------
// 1. исправить ошибку так, чтобы у ivan был тип не never
//
// 2. ПОДСКАЗКА. Ivan должен стать либо супер-админом, либо простым админом
// -------------------------------------------------------------

type User = {
    id: string
    username: string
}

// Типы возможных админов
type BasicAdmin = User & {
    role: "basic-admin"
}
type SuperAdmin = User & {
    role: "super-admin"
}

let ivan: BasicAdmin & SuperAdmin

// -------------------------- 2 пункт --------------------------
// -------------------------------------------------------------
// -------------------------------------------------------------

// Условие------------------------------------------------------
// Сделать тип для ответа сервера (то в каком виде нам пришли бы данные от него)
// 1. Создайте тип RequestPayload
//
// 2. О типе Promise вы узнаете совсем скоро, 
// но на данном этапе просто тип для промиса
//
// 3. !ОБЯЗАТЕЛЬНО! использование типа unknown
//
// 4. В типе запроса должны быть (data, errors, statusCode (100 - 499), requestUrl)
// -------------------------------------------------------------

type RequestPayload = {}

async function customFetch(): Promise<RequestPayload> {
    const data: RequestPayload = {}

    return data
}